frontend/controllers/SiteController.php



            //$var = Car::find()->where(['modebrand' => $car])->one();
            $var = Ncars::find()->where(['modebrand' => $car])->one();
---
SELECT * FROM `ncars` WHERE `modebrand`='Honda Amaze'

        public function actionFindcarsvar($model,$mod,$mo)
           {



          $rows=Ncars::find()->select('variant')->where('model=:model AND model_name=:model_name AND fuel=:fuel', array (':model' => $mo,':model_name'=>$mod,'fuel'=> $model))->distinct(true)->all();
---
SELECT DISTINCT `variant` FROM `ncars` WHERE model='Honda' AND model_name='Amaze' AND 'Petrol'=:'Petrol'

             public function actionFindcarscolor($var,$mod,$brand,$fuel)
                      {



 $rows=Ncars::find()->where('model=:model AND model_name=:model_name AND fuel=:fuel AND variant=:var', array (':model' => $brand,':model_name'=>$mod,'fuel'=> $fuel,'var'=>$var))->distinct(true)->all();
---
SELECT DISTINCT * FROM `ncars` WHERE model='Honda' AND model_name='Amaze' AND 'Petrol'=:'Petrol' AND '1.2 E i-VTEC'iant=:'1.2 E i-VTEC'

        public function actionQuote($quote)
        {
        $model = new ReplyForm();

        $access = [new Accessform];
        $color = [new Colorform];


        $mod="";

                 $pieces = explode("-", $quote);

                  $var = User::find()->where(['dealerid' => $pieces[0]])->one();
                  $var1 = Userrequest::find()->where(['user_id' => $var->id])->one();
                  $cars = Car::find()->where(['id' => $var1->car_id])->one();
---
SELECT * FROM `user` WHERE `dealerid`='11107081'
SELECT * FROM `userrequest` WHERE `user_id`=1
SELECT * FROM `cars` WHERE `id`=2