frontend/models/SignupForm.php

      public function signup2()
      {
      if ($this->validate()) {

       $user = new user();

        $user->username = $this->email;

      	$user->email = $this->email;

      	$user->firstname = $this->fname;
      	$user->lastname = $this->lname;
      	$user->phone = $this->phone;
      	$user->setPassword($this->email);
      	$user->generateAuthKey();
      	$transaction = \Yii::$app->db->beginTransaction();


      	if ($flag = $user->save(false))
---
INSERT INTO `user` (`username`, `email`, `firstname`, `lastname`, `phone`, `password_hash`, `auth_key`, `created_at`, `updated_at`) VALUES ('vaibhav@vaxa-asia.com', 'vaibhav@vaxa-asia.com', 'vaibhav', 'kothari', 9043233614, '$2y$13$zl/w8FoMx7jRVZr907R.tO7nl51yCTR1Ch0v.hGnSeg4mIlME46lO', 'TEaVIp8rfcSGRO0qJH-NK7Sec3ZM58di', 1439381025, 1439381025)


      	  //$model_name=$this->$model_name;

      	  $row=Ncars::find()->where('model=:model AND model_name=:model_name AND fuel=:fuel AND variant=:variant AND color=:color', array (':model' => $this->brand,':model_name'=>$this->model_name,'fuel'=> $this->fuel,'variant'=>$this->variant,'color'=>$this->color))->one();

      	   $user=User::find()->where('email=:email',array(':email'=>$this->email))->one();
---
SELECT * FROM `cars` WHERE model='Honda' AND model_name='City' AND 'Petrol'=:'Petrol' AND 'S'=:'S'
SELECT * FROM `ncars` WHERE model='Honda' AND model_name='Amaze' AND 'Petrol'=:'Petrol' AND '1.2 E i-VTEC'=:'1.2 E i-VTEC' AND 'Majestic Blue Metallic'=:'Majestic Blue Metallic'
SELECT * FROM `user` WHERE email='vaibhav@vaxa-asia.com'