frontend/views/site/choose.php


             //$estado = ArrayHelper::map(Car::find()->all(), 'model', 'model');

             $estado = ArrayHelper::map(Ncars::find()->select('model')->distinct('true')->orderby('model')->all(), 'model', 'model');
---
SELECT DISTINCT `model` FROM `ncars` ORDER BY `model`


             <?php

              $estado1 = ArrayHelper::map(Ncars::find()->where('model = :model_name', [':model_name' => $signup->brand])->all(), 'model_name', 'model_name');
---
SELECT * FROM `ncars` WHERE model = 'Honda'


             <?php

             $estado4 = ArrayHelper::map(Ncars::find()->where('modebrand = :mode', [':mode' => $car])->all(), 'fuel', 'fuel');
---
SELECT * FROM `ncars` WHERE modebrand = 'Honda Amaze'


              //$estado3= ArrayHelper::map(Car::find()->where('model=:model AND model_name=:model_name AND fuel=:fuel', array (':model' => $signup->brand,':model_name'=>$signup->model_name,'fuel'=> $signup->fuel))->all(), 'variant', 'variant');

             $estado3 = ArrayHelper::map(Ncars::find()->where('modebrand = :mode', [':mode' => $car])->all(), 'variant', 'variant');
---
SELECT * FROM `ncars` WHERE modebrand = 'Honda Amaze'